package com.wcqj.taiyi.utils;

import java.text.ParseException;
import java.text.SimpleDateFormat;
import java.util.ArrayList;
import java.util.Calendar;
import java.util.List;

public class Gua {
	
	private final static int TIANDI = 55;
	
	public final static String[] yangZhi = new String[] {"子","寅","辰","午","申","戌"};
	public final static String[] yinZhi = new String[] {"丑","卯","巳","未","酉","亥"};
	
    public final static String[] shui7 = new String[]{"壬","癸","子","亥","丙子","丁丑","甲申","乙酉","壬辰","癸巳","丙午","丁未","甲寅","乙卯","壬戌","癸亥"};
    public final static String[] huo9 = new String[]{"丙","丁","巳","午","丙寅","丁卯","甲戌","乙亥","戊子","己丑","丙申","丁酉","甲辰","乙巳","戊午","己未"};
    public final static String[] mu11 = new String[]{"甲","乙","寅","卯","戊辰","己巳","壬午","癸未","庚寅","辛卯","戊戌","己亥","壬子","癸丑","庚申","辛酉"};
    public final static String[] jin13 = new String[]{"庚","辛","申","酉","甲子","乙丑","壬申","癸酉","壬申","癸酉","庚辰","辛巳","甲午","乙未","壬寅","癸卯","庚戌","辛亥"};
    public final static String[] tu15 = new String[]{"戊","己","辰","戌","丑","未","庚午","辛未","戊寅","己卯","丙戌","丁亥","庚子","辛丑","戊申","己酉","丙辰","丁巳"};

    public final static String[][] gua = new String[][] {
    	{"乾","111111"},{"坤","000000"},{"屯","010001"},{"蒙","100010"},{"需","010111"},{"讼","111010"},{"师","000010"},{"比","010000"},
    	{"小蓄","110111"},{"履","111011"},{"泰","000111"},{"否","111000"},{"同人","111101"},{"大有","101111"},{"谦","000100"},{"豫","001000"},
    	{"随","011001"},{"蛊","100110"},{"临","000011"},{"观","110000"},{"噬嗑","101001"},{"贲","100101"},{"剥","100000"},{"复","000001"},
    	{"无妄","111001"},{"大蓄","100111"},{"颐","100001"},{"大过","011110"},{"坎","010010"},{"离","101101"},{"咸","011100"},{"恒","001110"},
    	{"遁","111100"},{"大壮","001111"},{"晋","101000"},{"明夷","000101"},{"家人","110101"},{"睽","101011"},{"蹇","010100"},{"解","001010"},
    	{"损","100011"},{"益","110001"},{"夬","011111"},{"姤","111110"},{"萃","011000"},{"升","000110"},{"困","011010"},{"井","010110"},
    	{"革","011101"},{"鼎","101110"},{"震","001001"},{"艮","100100"},{"渐","110100"},{"归妹","001011"},{"丰","001101"},{"旅","101100"},
    	{"巽","110110"},{"兑","011011"},{"涣","110010"},{"节","010011"},{"中孚","110011"},{"小过","001100"},{"既济","010101"},{"未既","101010"}
    };
    

    public final static String[][] yao = new String[][] {
    	{"顺利之象，但是运气好到极点就开始发生转变，会发生悔恨。","事业稳健之象，会获得身份和地位，还有合作伙伴的迹象。","如同站在悬崖边上一样，以退为进，需要看准时机，才能行动。","躁动会有损失，需要保持忧虑和谨慎的态度，才没有过错。","得贵人相助，有发展的机会，会身居要职。","沉稳等待时机，一动即生灾疾，谋事不利，会有阻力。",},
    	{"有竞争的困扰，会有大的损失，穷途末路，肝血不调。","功名大显，必能获利，和乐融融，病在肠胃。","受到阻碍，大凡谨慎收敛者，则无横来之祸。","谋望可成，认真经营会有收获，工作的会有升迁的希望。","衣食无忧，不愁吃喝，会有升迁，身居高位之象。","如履虎尾，翼翼小心。",},
    	{"前去无路，保命要紧，家庭遭变，须防损失。","谋事者，小事可成，大事无望，甚至会招来凶祸。","谋事可成，百事和合，会得到朋友的帮助，大吉大利。","陷入迷茫之中，眼前虚假的现象，需要安分守己，否则有灾难。","困顿艰难，踌躇不前。","面前的绊脚石比较多，难于前行。",},
    	{"宜守旧，不得行动，须防争讼，寇盗之扰。","依附于贵人、良师，才会顺遂，谋望可成。","处于困境之中不明白，很艰难。","会生是非，小则破财，大则伤身，小心饮食。","人情和合，百事有成，有财有福。","多有官诉，亲朋不和，多争斗，防止外伤。",},
    	{"宜谨慎，则忧愁自散。工作的会有升迁之机会，但须防谗邪之流。","会物产丰富，衣食不缺，也会有婚嫁之喜。","坏运逐渐远离，恢复平静，用尽心力才可出头。","难以到达预期，需要特别谨慎，谨防受骗。","会受到争诉之扰，若能以宽厚待人，则不辩自明。","必须久待，守恒为要。暂勿投资，货物无损。",},
    	{"会有争诉之忧，宜修德养身，化大为小。","经营、谋事、求财皆大吉。工作会受到重用。","宜保持常态，则无灾难。工作的宜谨守常职，晋升无望。","继承先辈的德行和财产，必须要防止危险的到来。","退而隐居，可保无害。小有耗损，不必多虑。","会生起是非，但终吉。有病者，不药而愈。",},
    	{"可立家计，或继承家业，但谨防小人从中作梗。","财富日增，若用人得当，则谋望可成，但须谨防小人之危。","安居乐业，无妄动之灾。工作不济，不宜妄想。","多有悲优，或有熟人病故。工作会受职待缺。","会遇到贵人，谋事可成。工作会受到上级的赏识，有升迁之机会。","经营得当，则财货日增。但妄动者，成少败多。",},
    	{"六神无主，恐有凶祸。白费心机，一无所获。当心头部疾病。","会先逆后顺，谋事有成，无往不利。工作会有大的荣耀。","出外有利，多得知己之力，事事顺利。工作会有升迁之喜。","交友不慎，或有争诉，破财刑伤。","得贵人之助，营谋遂意。工作会无过失，安然而吉亨。","会遇到知己，谋事称心如意。工作会有意外之喜。",},
    	{"会受到小人的骚扰，不妄进，则可免灾。","一时亨通，无往不利。","人情和合，营谋颇遂。工作会得到上司的提拔。","荣而见辱，进而见退，有朋友是非，血气损伤。","有人相助，营谋遂意。工作有升迁之机会。","宜守旧业，不宜创新。谋事者，须防猜忌疑惑之祸。",},
    	{"财利可获，工作宜退而以享安静和平之福。","躁动妄行者，则祸患将至，工作会功高盖主。","跟在老虎后面走路，谨慎小心。","会有争诉，囚狱之扰，工作会有被贬职之祸。","安然自乐，修身养性。工作会有全身而退之兆。","等待时机，自有成就。守好旧业，久必获利。",},
    	{"谨慎自守，须防止小人。有破损，有疾病。","会得到别人的赏识和抬举，有升迁喜事。","营谋失利，退守可平安。工作进取难成，宜退守。","须谨慎自持，宜保守，则安，不然会犯小人，事事遇阻。","会有好运，必遇尊贵，但要防长上有损，言语有伤。","因人成事，逐步升迁。",},
    	{"好运来临，被困住的人即将好转，局面发生大的变化。","旧祸已去，好运将至，诸事皆吉。","工作会得到朋友和同僚之助，或升迁，或进财。","须防是非争诉的忧虑，工作会退休离职。","宜忍耐，宽容待人，不然会生是非。","小人得势之时，须谨防小人牵连之事。",},
    	{"宜静守，不宜激进，诸事无碍。","先苦后难，辛苦有成，所尝心愿。","退守不动，反而吉祥。","有诉讼、纠纷的祸患，凶。","境况艰难，未能顺遂。","眼前平顺，可以进行经商规划，没有灾祸。",},
    	{"一路好运，事事吉祥。","众人信服，亨通，不可骄傲自负。","避免眼睛方面的疾病，安于现状，不可激进。","荣升之时，勿近小人，否则必败。","正交好运，一路顺风。","小人欺凌，比较艰难，刻苦勤勉，等待好运。",},
    	{"好运已经过去，心里所想的事情会受阻。","会得到贵人帮助，防止口舌是非。","正当好运，事情顺利，防止过盛伤身。","劳苦有成，亨通。","有工作升迁，读书进取的迹象。","不与他人争斗，自然没有事端。",},
    	{"心气太高，会有诉争之忧","多心事，有阻碍，凶。","大运正行，不必担心，会有贵人。","投机取巧，会有悔恨，凶。","激流勇进，有成名的机会。","有口舌之争，遭遇阻力、困境。",},
    	{"困难重重，不遂心意，防止小人中伤。","正当好运，诸事皆为吉利。","吉凶互见，会得到好人的帮助，化凶为吉。","求财求名，皆为正运。","防止小人的暗算，有是非，最好谨慎。","正当好运，有升迁的迹象。",},
    	{"能遇贵人，获得提拔。但仍要以退为进，比较有利。","有喜庆之事，进取有望，名誉远播。","事事有忧愁，当心腿上的疾病。","急于前进，会有损失。不要听信谗言，则无难。","改革创新，顺势而行，谨慎小心。","会得到祖先的庇佑，顺心顺意。",},
    	{"好运接近尾声，防止运势太盛而变得衰败。","万事如意，会得到贵人的赏识，把握机会。","好运已到，有吉无凶。","有忧愁，会受苦劳累，受到小人谗言攻击。","有贵人相助，运气正佳。","会得到众人的拥戴，能够升迁，大吉。考试的话，学业顺利。",},
    	{"运势不通，心有余而力不足。","时来运转，无往不利，爵禄有升。","正当好运，有利有名，喜事临门，但需要注意身体上的症状。","需谨慎行事，知难而退。","在家不如意，外出谋事则好，防止因女人而起是非。","事情有困难，容易弄巧成拙，不宜妄动。",},
    	{"有与人争辩的现象，并且耳目不明，气血不顺。","有病的自然痊愈，有冤屈的会昭雪，诸事顺利。","经商获利，工作升迁，读书有名。","不易成事，运气不佳，有所损失，遭人埋怨。","进退艰难，是非不断。有暗疾，骨肉有伤痕，有所纠结。","谨慎行事，防止小的灾难，以免生祸端。",},
    	{"防止好运转凶，家中亲属有命终之象，工作者会升迁。","能遇贵人，经营获利，受到重用。","先凶后吉，忧愁中有喜事，虽有危险，但是终得安宁。未结婚着，有望成家。","好运来到，不必费力。即使有是非到来，也不足为患。","得人提拔好运可期，配合富商，必可获利。工作中，升迁有望。","多奔波，静守凶险，动则吉祥，工作中，防止有被辞退的风险。",},
    	{"须谨慎，踏实稳重者可无忧，气运衰减。","气运甚佳，事情顺利。工作升高进职，居要位。","时运不佳，危难之时，多有争辩之事。工作须谨防小人的谗言。","不顺之象，欲求名利，必须创新，而且父母有忧，须谨防。","受到小人的侵辱，以及受到他人的猜忌。","事情不顺遂，或有手足之灾，或兄弟不睦，但工作有升迁机会。",},
    	{"做事乖张，谨慎免祸。","会有积蓄，但要谨防熟人出意外。","虽然思想振作，但是力不从心。筹谋规划，资本不足。","事多反复，阴阳差错，时好时坏。","与人共利，事业兴旺，疾病可痊愈。工作会得到复职。","好运渐起，一切顺利。万事如意，经营获利。",},
    	{"好运已过，不可妄动，否则是非迭生，唯有变通可免祸。","求谋有成，病得愈，以及有生育之喜。","气运平顺，妄动有过错。工作宜静守，不能妄动。","尴尬之期，小心意外。","好运当头，意外之财。不谋而获，大利到手。","守株不宜，出而有为，会得到上司的赞许，同事的爱戴。",},
    	{"青云直上，可喜可贺。","谋事顺利，多有喜庆之事，工作会高升。","谋划有望，工作会有升迁之喜。","会得到长辈的重用，或知己相助，前运辛苦，后可有获。","须谨防是非，或有足疾、腰疾。","宜守旧，不然会有不测之祸。",},
    	{"先艰难而终吉利。","会有依靠，事可成，但不可乘船涉险。","会得到好人的帮助，求谋遂意。","无路可走，闭门思过。运势低迷，有离别之悲。","大起大落，是非不一，凶者病致死。","为争夺财利而起祸，大凡心底善良守正道者可无忧。",},
    	{"不宜进取，退守为安，面部或有疾。","先逆后顺之象，工作不可久任。","可做大事，勿谋小事，工作必能受到重用。","须防大难而遭致家产有失，或有足目之疾。","虽有危险，但是会得安全。","谨慎行事，财利可固。凶者，防孝服之忧。",},
    	{"防止意外之灾，小心牢狱。","平淡无常，宜养精蓄锐。","多喜事，有结婚之喜，工作多饮食之乐。","多坎坷，多争诉之事，工作宜退守。","工作有小成就，防险难而生心腹血气之疾。","时运不佳，宜防跌入陷阱灾难之中。",},
    	{"时运佳，多喜事，经营获利。","不宜进取，宜守常。工作在位者得志，退职者多险危。","时运不济，困难重重，或和长辈不睦。","乐中生悲，吉中生愁，险难迭生。","财利可获，工作会受到重用。","防无妄之灾，宜谨慎，或有足疾。",},
    	{"多有口舌之争，防止被他人诽谤。","所求不成，等待时日。","朋友相助，可谋小事，大事有困难，心绪不定。","最好退守，工作谨防被贬。","奔波徒劳，宜静不宜动。","行事过急，多难成就，工作需等待机会。",},
    	{"求名望利，小能成，大则无功。","多招毁谤，有所损失。","营谋费力，难以成事。时运不济，有所退步。","须防小人诽谤，争诉之扰。","安分守己则无忧。","人情乖离，前途渺茫，静守可免祸。",},
    	{"求谋获利，家肥业厚。",
    		"功成身退，值得嘉许，避开阴邪之事。",
    		"虽有收获，但谨防因小人而受祸。",
    		"多灾多难，宜急流勇退。",
    		"家中有争执，安常守分无忧。",
    		"宜安分守己，可无忧，宜择机而退。"},
    	{"进退两难，多是非争诉，宜守常。工作宜退不宜进。",
			"一筹莫展，不能得利，病者有丧身之兆。",
			"前途无阻，功名显现。",
			"有官司之事，人财不利。工作多祸难，进退难安。",
			"求谋得意。工作的中庸处事，心中无愧。",
			"会有争诉，动则凶，须防足疾。"},
		{"好运将终，防止事故，不良者有争诉之忧。",
			"好运到来，求谋获利。",
			"时运不佳，或有争诉。工作不宜进取，有阻力。",
			"得朋友之助，营谋遂意，但谨防意外之险。",
			"求谋称意，多得母亲扶助，或得妻财。做官的守正者会进取。",
			"忧愁参半，静则吉，动则凶。需要耐心等待。"},
		{"所处的集团或单位之中，领导昏庸，小人当道。",
			"难逢知己，家里会有疑难之事，工作须修德养性可保无忧。",
			"出外求谋者会顺利，但当心生心腹之疾。",
			"有修屋造作之兆，不良者，左股或有伤，多忧愁分离之患。",
			"会得贵人之助，工作会有实权，能当大任。",
			"工作有升起之象，但谨防有失。"},
		{"虽然生活中的各个方面，还比较顺利，但是好运将要过去。",
			"人心感通，自然吉祥，但需要防止肝火过旺。",
			"时运正佳，贵人提拔，工作仕途顺利。",
			"忧喜参半，谨防沉迷于享乐中。",
			"求谋成事，尚可如意，工作会有一定成就。",
			"谋事有成，未婚者会结婚。"},
		{"遭污诬陷，先损后益，防止被诽谤之忧。",
			"经营获利，抬举有人。不良者，亲朋怨恶，骨肉刑伤。",
			"能得到朋友的帮助，转危为安，求婚者必配。",
			"恐有刑伤，险中求安，先迷后顺。",
			"风云际会，勇往直前，升迁有望。",
			"先失而后得，人事先离而后合，谨防凶恶之灾患。"},
		{"大运将至，名利皆来。货涨船高，贵人相助。",
			"会得到贵人提举，无往不利。",
			"不良者会有争诉。工作有进升之机，求名望利皆有实而不虚。",
			"出门困难重重，归来笑逐颜开。或有妻子之喜，工作会晋升。",
			"涉艰历险，求谋有阻，人财两失。",
			"出门艰难，暂时退守，稳步进取。"},
		{"运途顺利，多营谋获利，须防小寇。",
			"正当好运，君子有利，病者愈。",
			"须防小人，或有交友不慎之祸。获利不多，朋友交心。",
			"须防窃盗，是非诉讼。工作谨防被贬之忧。",
			"正当好运，财利可获。",
			"经营者吉，未婚者配。工作晋升有望，读书人会取得好成绩。"},
		{"贵人扶持，财利可期。工作会得到下属的爱戴，领导的器重。",
			"运势大好，财利丰富。",
			"多喜庆之事，有灾者转好运，有病者愈，有忧者转喜。",
			"获利者多，未婚者配。做官的与同僚关系融洽，进取有望。",
			"宜谨守勿动。工作时机未成熟，难于升迁。",
			"谋事得当，可获利，不良者，或因酒食误事。"},
		{"贪图名利，或有意外之祸，刑克损伤之灾。",
			"谋望称意，事多顺利。工作会遇到明主，仕途顺利。",
			"眼前有难，暂避为宜。",
			"常人获利，不良者有凶，防止意外官灾。",
			"意外得财，又能守住。如有神助，必得厚利。",
			"大事可成，万事称心，工作受到提拔，读书取得好成绩。"},
		{"声名有所损伤，警惕行事方能免祸。",
			"求谋遂意，诉者伸，有病者愈。工作须防奸邪之辈侵害。",
			"心绪不定，所谋不成。工作有心而力不足，难于升迁。",
			"会有争诉之忧，品行端正者无忧，初见艰难，终得安乐。",
			"多忧愁，多惊险，谨防盗窃之事发生。",
			"会有无妄之灾，宜静守。工作躁动者有损。"},
		{"营谋艰辛，孤立无助，好运将尽。",
			"会遇到贵人提携，有意外之喜。",
			"多是非之扰，工作有损，多难。",
			"多灾难。工作会退步，或者被贬。",
			"有财运，妇人则有怀孕之喜。工作晋升有望。",
			"遇贵人好友提携而发财，女人有生育之喜，但须防疾诉忧患。"},
		{"事多烦扰，不能安宁，长幼忧愁，名利成虚。",
			"人情不合，营谋有阻。工作不得人心，其志未光。",
			"不从正道者，会有凶祸。工作须防他人猜忌，宜弃高就低。",
			"家里不安，工作在位不得安宁，出外则艰辛。",
			"正当好运，贵人提举，营谋得利。",
			"会受到小人的陷害，先凶后吉，宜谨慎从事。"},
		{"有贪得无厌之祸。工作会告休。",
			"正行好运，大愿可成。做官的会高升。",
			"得山林之利，隐者有山林之乐。工作会升迁，身居要职。",
			"营谋遂意，工作会身居要位，读书人可成名。",
			"常人有喜，病者安，谋事可成。工作有升迁之机。",
			"名利双收，营谋遂心。做官的晋升有望。"},
		{"防惊忧丧服之扰，惟商人、旅行者顺利。工作的会有刑罚束缚之忧。",
			"先难后易，不良者有诉刑之扰。工作会先阻后顺。",
			"谋事虽然不利，但终有出险之时，但商人有周转不利之象。",
			"多难之时，宜守正谨慎。",
			"得贵人提携，营谋获利，静吉动凶。",
			"有惊忧，或有丧服之灾。工作会退职。"},
		{"谋事顺利，财用充足。工作功高德厚，能得升迁。",
			"营谋遂意，工作品行端正，会得到上司的赞赏。",
			"宜安分守己，或有迁居之喜。工作可望上进。",
			"安分守己为吉，不良者或有灾。工作难逢明主，需另觅良机。",
			"宜谨守以避祸。工作宜退以自保。",
			"谋事有阻。工作会退居闲职，求名者不遂。"},
		{"安分守己则是非不扰。工作进取者会晋升，离退休者会功成身退。",
			"时运转好，多吉利之事。工作晋升有望。",
			"会有转变，有收获。工作会有升迁之机。",
			"多事之时，谨慎而行。工作有躁动失政之忧。",
			"多喜庆之事，工作会升迁。身体疾病即将痊愈。",
			"宜谨守常规，不可存非分之想。工作不宜进取，切不可怀出位之念。"},
		{"安稳利达，谋求遂意。工作闲职者复职，离退者功成身退。",
			"时运不错，多获利。工作多吉兆，多升迁。",
			"多灾之时，或生足疾。工作有被贬职之忧。",
			"先难后易，多不如意。工作会遇到阻力，但最终的结果会好。",
			"虽有收获，但须防忧。工作秉公执政，须防小人的谗言之扰。",
			"因人成事，多喜事，或结婚，或生子，忧者喜，贱者贵。工作会因功得晋升。"},
		{"须谨防意外，成家者，或夫妻争吵之事。工作要谨防被贬职之忧。",
			"不吉之时，或有手足受损之忧。工作守常者无忧。",
			"一筹莫展，前进有阻。工作有被贬职之危。",
			"多忧愁，多灾难，宜谨慎，可免祸。工作不宜进取。",
			"多难之时，或有争诉，小心为妙。工作有遭奸邪之辈陷害之忧。",
			"好运到来，先惊后喜。"},
		{"多福多利，但易防不吉之事。做官的会升迁。",
			"正人君子，人情和合，谋望遂意。工作会居要职。",
			"宜安分守常，不可有非分之想。",
			"不顺之时，危难不安。",
			"运势受阻，或奔波在外，多劳苦；或有足疾。",
			"宜守本份，不要纵欲。工作保守己职者无失。"},
		{"得人荐举，谋望有成，祸患不侵，多福多利。",
			"先难后易，工作多招诽谤，先暗后明。",
			"利于修造，自给自足。工作须随遇而安，升迁无定。",
			"多惊扰，人情不睦，盗贼侵害，工作上进有阻力。",
			"无往不利，随处皆安。",
			"运气不佳，谋为不利。"},
		{"事多不顺，营谋皆空。工作居虚位而无实禄。",
			"正值好运，或成婚，或得财。工作会受到重用，身居要职。",
			"不是佳期，须待时运。",
			"进退无常，劳役悲苦。工作有被降职之忧。",
			"不宜进取，守旧者则祸害不生。",
			"有小德，谋望顺遂。工作或有政绩。"},
		{"骨肉相残，离祖成家，难免口舌之争。",
			"会得好人提举，谋望称意。",
			"明而受蔽，得人解释而吉。工作受到领导和同僚的猜忌，位不安。",
			"营谋难遂，或明而受蔽，争诉日起，或手足有疾，难于做事。",
			"坚守正道，逢凶化吉。以诚待人，拨云见月。",
			"有小德，谋望顺遂。工作或有政绩。"},
		{"有失无得，乐极生悲。小利大损，十分凶险。覆巢之险；先喜后悲。",
			"会得到老者的帮助，事有所成。",
			"在外者会有所成就，但美中不足，有忧惨是非之事发生。",
			"运势转坏，多灾多难。工作有离职之忧。",
			"运气转好，营谋有成。工作显耀。",
			"运气不佳，须防祸难。本小利微，小心灾祸。"},
		{"多损失，或生疾病。工作有运不逢时，须谨慎。",
			"谋望有成，无往不利。工作先阻后顺。",
			"正当好运，多福多利。",
			"运势低迷，有穷困之厄。工作有被贬职之忧。",
			"诚恳待人，谋望获利。工作有升迁之机。",
			"谋事不成，犹豫不决，无利可图。"},
		{"靠人扶持，平平之运。有人指引，稍有小利。内忧外患；似非正聘。化解内邪，才可保全。",
			"时运不佳，多意外之祸。工作会受到小人的诽谤。",
			"从商获利，或进人口，不良者或有疾病，谋望不成。",
			"会有意外之祸，甚者则失道忘身。工作有听信谗言而遭辱之忧。",
			"正当好运，事事和顺。工作有升迁之兆。",
			"人情和合，百谋皆遂。"},
		{"先难后易，运势好转。外出就职者会有灾难。",
			"正当好运，事事皆吉，求利者遂。工作会升迁。",
			"先凶后吉，谋望和合，求利可获。工作会身居要职。",
			"常人获利，工作会出外就职。",
			"谋望有成，工作会有实权。",
			"险中得救，必有后福，求谋皆遂。工作会受到重用，有望晋升。"},
		{"不得天时，名利皆无。工作不知变通，前途渺茫。",
			"正当好运，谋望有成。",
			"秉公守法，安于正道，福利可获。工作会得到上司的欣赏，升迁有望。",
			"多辛苦，少收获。",
			"时运不佳，事多乖离，宜动不宜静。工作不得时运。",
			"进取不利，宜守旧。"},
		{"多虚少实，前路凶险。经商者会有损失。",
			"运势中正，有求必应。同心协力，经营有成。",
			"能得到提拔，但有失去财产之忧。",
			"喜中有忧，事多反复。工作同事不睦，先进后退。",
			"无往不利，多进钱财，工作会晋升。",
			"得贵人提举，谋事有成，但喜中有忧，宜行正道，修身养性，不可逸乐。"},
		{"时运不佳，不知退守，过刚则折。",
			"不利谋事，守旧为佳。工作有告休之危。",
			"观察情势，不可妄动。适可而止，切勿过贪。",
			"时运不济，谨防意外。工作须防小人奸邪之辈所害。",
			"得贵人指引，谋望有成。工作要严于律己，恪守己职，",
			"不得天时，灾难突来。工作有骤然取祸之忧。读书人则有一飞冲天之兆。"},
		{"小人侵扰，坐船者，防溺水之灾。工作有过刚则折之忧。",
			"近谋有实，远谋多虚，不利东方，利于西方。",
			"时运平平，有备则无患。工作须做好预防，则爵禄稳固。",
			"有结怨争诉之损。",
			"先难后易，有先逆后顺之美。",
			"时运未到，欲动未动，安保无虞。"},
		{"行险而顺，不良者有溺水之厄，纵酒之灾。工作有望升迁。",
			"谋望有成，财利丰厚。工作能得到升迁。",
			"会得好人提举，获利丰厚。工作会受到重用，名利双全。",
			"见机而作，妄动则凶。把握良机，船运有利。",
			"安份守纪者，谋望遂意。工作克服困难者，晋升有望。",
			"经营不利，涉水行舟者，谨防溺水之患。工作仕途有阻碍。"}
    };


    

    
    
	public static int getChushen(Calendar cal) throws ParseException {
		
		int chushen = 0;
		
		String gYear,zYear;
		String gMonth,zMonth;
		String gDate,zDate;
		String gHour,zHour;
		
		Lunar lunaryue = new Lunar(cal.getTime());
		int time = cal.get(Calendar.HOUR_OF_DAY) / 2;
	    
		BaZi lunar = new BaZi(cal);
	    String GanZhi = lunar.getYearGanZhi(time);//取八字
        String[] tempchar = GanZhi.split(",");
//        lunar.getnumberYear()
        String ganziyear = tempchar[0];;//年柱
        String ganzimonth = lunaryue.getCyclicaMonth();//月柱
        String ganziday = lunaryue.getCyclicaDay();//日柱
        String ganzitime = tempchar[3];//时柱
        
	       
		gYear =  ganziyear.substring(0, 1);//年干
        zYear = ganziyear.substring(1, 2);//年支
        
        gMonth = ganzimonth.substring(0, 1);//月干
        zMonth =  ganzimonth.substring(1, 2);//月支
        
        gDate = ganziday.substring(0, 1);//日干
        zDate =  ganziday.substring(1, 2);//日支
        
        gHour = ganzitime.substring(0, 1);//时干
        zHour =  ganzitime.substring(1, 2);//时支
        
//        System.out.println("农历:"+lunar.toString()+" 年:"+gYear+"-"+zYear+" 月:"+gMonth+"-"+zMonth+" 日:"+gDate+"-"+zDate+" 时:"+gHour+"-"+zHour);
        
        int cYear7 = getValue(shui7,7,gYear,zYear);
        int cYear9 = getValue(huo9,9,gYear,zYear);
        int cYear11 = getValue(mu11,11,gYear,zYear);
        int cYear13 = getValue(jin13,13,gYear,zYear);
        int cYear15 = getValue(tu15,15,gYear,zYear);
        
        int cMonth7 = getValue(shui7,7,gMonth,zMonth);
        int cMonth9 = getValue(huo9,9,gMonth,zMonth);
        int cMonth11 = getValue(mu11,11,gMonth,zMonth);
        int cMonth13 = getValue(jin13,13,gMonth,zMonth);
        int cMonth15 = getValue(tu15,15,gMonth,zMonth);
        
        int cDate7 = getValue(shui7,7,gDate,zDate);
        int cDate9 = getValue(huo9,9,gDate,zDate);
        int cDate11 = getValue(mu11,11,gDate,zDate);
        int cDate13 = getValue(jin13,13,gDate,zDate);
        int cDate15 = getValue(tu15,15,gDate,zDate);
        
        int cHour7 = getValue(shui7,7,gHour,zHour);
        int cHour9 = getValue(huo9,9,gHour,zHour);
        int cHour11 = getValue(mu11,11,gHour,zHour);
        int cHour13 = getValue(jin13,13,gHour,zHour);
        int cHour15 = getValue(tu15,15,gHour,zHour);
        
        int c = TIANDI + cYear7+cYear9+cYear11+cYear13+cYear15+
        cMonth7+cMonth9+cMonth11+cMonth13+cMonth15+
        cDate7+cDate9+cDate11+cDate13+cDate15+
        cHour7+cHour9+cHour11+cHour13+cHour15;
        
        
		chushen = c%64==0 ? 64 : c%64;
        
		return chushen;
	}
	
	private static class GuaObject{
		public  GuaObject(int key,int value) {
			this.key=key;
			this.value=value;
		}
		public int getKey() {
			return key;
		}
		public void setKey(int key) {
			this.key = key;
		}
		public int getValue() {
			return value;
		}
		public void setValue(int value) {
			this.value = value;
		}
		int key;
		int value;
	}
	
	public static String monthYao(int lunarMonth, int monthGua) {
		String yaoValue = "";
		//1阳, 0阴
		int yinYang = 0;
		if(lunarMonth%2 != 0) yinYang = 1;
		
		String guaName = gua[monthGua-1][0];
		String guaYao = gua[monthGua-1][1];
		
		List<GuaObject> list = new ArrayList();
		if(yinYang==0) {
			for(int i=0;i<guaYao.length();i++) {
				if(String.valueOf(guaYao.charAt(i)).equals(String.valueOf(yinYang))) {
					GuaObject go = new GuaObject(i,yinYang);
					list.add(go);
				}
			}
		}else {
			for(int i=guaYao.length()-1;i>=0;i--) {
				if(String.valueOf(guaYao.charAt(i)).equals(String.valueOf(yinYang))) {
					GuaObject go = new GuaObject(i,yinYang);
					list.add(go);
				}
			}
		}
		
		if(list.size()==0) {
			yaoValue = "系统正在分析请稍后再试";
		}else if(list.size()==1) {
			yaoValue=yao[monthGua-1][list.get(0).key];
		}else {
			yaoValue=yao[monthGua-1][getYaoKey(list,lunarMonth)];
		}
		
		
		return yaoValue;
	}
	
	public static String dateYao(String ganzhiDate, int dateGua) {
		String yaoValue = "";
		//1阳, 0阴
		String gDate = ganzhiDate.substring(0, 1);//日干
	    String zDate =  ganzhiDate.substring(1, 2);//日支
		int yinYang = 0;
		for(int i=0;i<yangZhi.length;i++) {
			if(zDate.equals(yangZhi[i])) yinYang=1;
		}
		
		int sort = 0;
		while(!zDate.equals(BaZi.Zhi[sort])){
			sort++;
		}
		
		String guaName = gua[dateGua-1][0];
		String guaYao = gua[dateGua-1][1];
		
		List<GuaObject> list = new ArrayList();
		if(yinYang==0) {
			for(int i=0;i<guaYao.length();i++) {
				if(String.valueOf(guaYao.charAt(i)).equals(String.valueOf(yinYang))) {
					GuaObject go = new GuaObject(i,yinYang);
					list.add(go);
				}
			}
		}else {
			for(int i=guaYao.length()-1;i>=0;i--) {
				if(String.valueOf(guaYao.charAt(i)).equals(String.valueOf(yinYang))) {
					GuaObject go = new GuaObject(i,yinYang);
					list.add(go);
				}
			}
		}
		
		if(list.size()==0) {
			yaoValue = "系统正在分析请稍后再试";
		}else if(list.size()==1) {
			yaoValue=yao[dateGua-1][list.get(0).key];
		}else {
			yaoValue=yao[dateGua-1][getYaoKey(list,sort)];
		}
		
		return yaoValue;
	}
	
    private static int getYaoKey(List<GuaObject> list,int month) {
        //gua + 倒序 gua.size()-1
//        List <GuaObject> gua_d = new ArrayList<>();
//        for(int i=list.size()-2;i>0;i--){
//            gua_d.add(list.get(i));
//        }
//        list.addAll(gua_d);

        if(month>=list.size()){
            month = month % list.size();
        }
        if(month == 0)  month=list.size()-1;
//        System.out.println(list.get(month));
        return list.get(month).key;
    }

	private static int getValue(String[] gz,int num, String g, String z) {
		
		int count = 0;
		
		for(String s : gz) {
			if(g.equals(s) || z.equals(s) || (g+z).equals(s)) {
				count = count + num;
			}
		}
		
		return count;
	}
	
	
}
